{
    "0": "Aloevera -----Benefits: Aloe vera juice is a rich source of antioxidants, which help fight free radicals. This lowers oxidative stress on your body and reduces the risk of chronic conditions such as diabetes, heart disease, and cancer. Aloe vera juice is also an excellent source of: Vitamin C. ------ (https://dir.indiamart.com/impcat/aloe-vera-leaf.html)--------location:(https://dir.indiamart.com/impcat/aloe-vera-leaf.html)",
    "1": "Amla -------Benefits: Amla's high-fat burning properties have been shown in various studies. This plant accelerates metabolism, improving protein synthesis and reducing fat deposits. It also favours fluid reduction because it promotes diuresis with the excretion of organic toxins through the urine.--------location: (https://g.co/kgs/LTKi4SJ)",
    "2": "Amruthaballi ------Benefits: Amrutha Balli Powder is renowned for the treatment of diabetes, urinary tract conditions, kidney infections, asthma, cardiac conditions, amongst others. It is rich in antioxidants and has anti-viral and healing properties. It helps boost your immunity and helps battle several chronic conditions. --------- location: (https://lushful.org/products/amrutha-balli)",
    "3": "Arali ---------Benefits: Secretly, peepal tree leaf looks similar to heart shape. Hence it is highly effective in treating heart diseases, especially this tea is helpful to treat the heart blockage. It's anti-oxidant, anti-asthmatic, anti-microbial properities.---------location:(https://www.agropack.in/agropack_plantinnerdetails.php?item=Red%20Arali%20Oleander%20For%20Sale&catid=91-146&itemid=1160)",
    "4": "Astma_weed -----Benefits: Asthma weed has been used for the remediation of respiratory diseases, some female diseases, and others such as dysentery, jaundice, gonorrhea, pimples, tumors, digestive problems, and childhood infections.--------location:(https://gachwala.in/products/gachwala-euphorbia-hirta-asthma-plant-live-medicinal-plant-live-asthma-weed-betel-vine-plant-ayurvedic-herbal-plant-live-plant-with-pot/)",
    "5": "Badipala ---------Benefits: Traditionally, the leaf juice of the peepal tree may be helpful for cough, asthma, diarrhoea, ear pain, toothache, haematuria (blood in urine), migraine, scabies, eye troubles, and gastric problems.--------location:(https://creativemarket.com/product/66473518-Red-flower-Impatiens-Balsamina-flower-commonly-known-as-balsam-garden-balsam-rose-balsam-touch-me-not-or-spotted-snapweed-is-an)",
    "6": "Balloon_Vine ---------Benefits:It is an herbaceous climber from the Sapindaceae family which is found in almost every Continent and Oceania. In the traditional Indian medicine systems, this plant is used for the treatment of rheumatism, abdominal pain, orchitis, dropsy, lumbago, skin diseases, cough, nervous disorders, and hyperthermia.-----------location:(https://www.herbalplantslive.com/product/buy-mudakathan-balloon-vine-plant-online-india-at-best-price/)",
    "7": "Bamboo -----------Benefits:They are used as a traditional medicine with demonstrated effects of anti-oxidation, free radical scavenging, anti-inflammatory, liver protection and ameliorating cognitive deficits. Bamboo leaf is mainly used for the treatment of atherosclerotic, diabetic and nervous system diseases.-------------location:(https://www.etsy.com/in-en/market/bamboo_leaves)",
    "8": "Beans ----------Benefits:Bean leaves contain significant amounts vitamin A zinc and iron that are important within the diet. Different genotypes and varieties contain different amounts of vitamin A and zinc. However they contain nearly equal amounts of iron so whichever variety consumed will deliver significant amounts.------location:(https://freshharvest.com/p/shop/item/4352/bean-leaves)",
    "9": "Betel ---------Benefits:Betel leaf juice provides relief from internal pains in the body. Betel leaves are a powerhouse of antioxidants that clear radicals from the body. It restores normal PH levels in the body and helps an upset stomach. Ayurveda widely recommends eating betel leaves for relief from constipation.----------location:(https://www.bigbasket.com/pd/20001347/fresho-betel-leaf-5-pcs/)",
    "10": "Bhrami -----------Benefits:Brahmi (derived from the name of Lord Brahma and Goddess Saraswati) is a perennial herb most well known for its memory enhancing property. Brahmi tea that is made by brewing Brahmi leaves helps to manage cold, chest congestion and bronchitis by clearing out the mucus from the air passages which helps ease breathing.-------location:(https://www.amazon.in/brahmi-leaves-fresh/s?k=brahmi+leaves+fresh)",
    "11": "Bringaraja --------Benefits:Imbued with these potent properties, bhringaraj is extensively used for treating a host of health issues like hair problems, skin and tooth infections, worm infestations, cough, cold, asthma, anaemia, inflammation, leprosy, and other infections.--------location:(https://www.indiamart.com/proddetail/bhringraj-leaves-22660988062.html)",
    "12": "Caricature ----------Benefits:Here is how cartoons and caricature are beneficial for kids, all while acting as portals into fantastical worlds. Although normal drawing and doodling can be fun activities, inducing a more narrative-led perspective to them can allow your child to self-express in a creative and challenging way.------location:(https://nurserybuy.com/product-tag/caricature-plant/)",
    "13": "Castor -----------Benefits:Castor root, seeds and leaves are extensively used in Ayurveda treatments, both for externally and internally. Castor is aphrodisiac, relieves pain and is useful in neurological disorders. Botanical Name- Ricinus Communis Linn.-----------location:(https://thewholesaler.in/products/castor-leaf-extract-ricinus-communis-linn)",
    "14": "Catharanthus ------------Benefits:Catharanthus roseus (C. roseus) is an important medicinal plant distributed in many countries. It has attracted increasing attention due to it being shown to possess a range of phytochemicals with various biological activities such as antioxidant, antibacterial, antifungal, antidiabetic and anticancer properties.--------location:(https://www.indiamart.com/proddetail/vinca-rosea-leaves-10523154855.html)",
    "15": "Chakte ---------Benefits:Achyranthes Aspera is used in the treatment of boils, asthma, in facilitating delivery, bleeding, bronchitis, debility, dropsy, cold, colic, cough, dog bite, snake bite, scorpion bite, dysentery, earache, headache, leukoderma, renal complications, pneumonia, and skin diseases.-------location:(https://www.etsy.com/listing/1543298395/chakte-viga-and-ceylon-satinwood-box)",
    "16": "Chilly ---------Benefits:Chili leaves can boost the immune system and stimulate the production of insulin. In its crushed form, it can heal wounds and treat symptoms of arthritis and the shingles. Chili leaves are low in fat and calories and also decrease the levels of bad cholesterol in your body.---------location:(https://www.indiamart.com/proddetail/chilli-plant-21083013897.html)",
    "17": "Citron lime (herelikai) ---------Benefits:The citron is a known immunity booster, and a panacea for all gut troubles. Its slightly bitter taste is a wonderful palate cleanser, and is known as 'pitta-ahara' in Ayurvedic texts, the remedy for 'pitha dosha' characterised by conditions of nausea, acidity and indigestion.--------location:(https://www.medindia.net/health/diet-and-nutrition/citron-lime-benefits-and-recipes.htm)",
    "18": "Coffee -------Benefits:One of the most abundant chlorogenic acids in the coffee leaf is 5-CQA (5-O-caffeoylquinic acid). It has been proven to have neuroprotective, cardiovascular protective, and anti-inflammatory effects. Chlorogenic acid helps lower blood pressure and improve blood vessel function in both healthy and hypertensive people.-----------location:(https://www.indiamart.com/proddetail/green-coffee-leaves-20178522091.html)",
    "19": "Common rue(naagdalli) -----------Benefits: Crushed rue leaves are placed in the ear canal to relieve ear aches and headaches. Externally, rue is applied as a skin antiseptic and insect repellant, as well as a poultice against rheumatic pain. Due to its toxicity, the use of this plant is now considered obsolete by modern scientific herbalism (phytotherapy).--------location:(https://www.herbalplantslive.com/product/buy-aruvatham-pachai-common-rue-satap-plant-online-india-at-best-price/)",
    "20": "Coriender ----------benefits: Notably, coriander was used in India for relieving gastrointestinal discomfort, respiratory, and urinary complaints; additionally, in some areas of Pakistan, the whole plant of coriander has folk medicinal uses to treat flatulence, dysentery, diarrhea, and vomiting.-------- location:(https://www.bigbasket.com/pd/10000097/fresho-coriander-leaves-100-g/)",
    "21": "Curry ----------benefits: Apart from aiding in weight loss, curry leaves also have other nutritional benefits. “They are rich in vitamins A, B, C, and E, along with vital minerals like calcium, phosphorus, and iron. ----------location:(https://pluckk.in/curry-leaves?sku=111011189AX)",
    "22": "Doddpathre -----------Benefits:Doddapatre contains powerful expectorants that help to eliminate mucus and phlegm from your respiratory tracts. Doddapatre is used in skin treatment. Doddapatre possesses anti-inflammatory compounds that can quickly reduce redness and swelling while also eliminating itchiness and irritation.----------location:(https://www.theecostore.in/Products/Doddapatre-Leaves-1-Bunch?product-id=376)",
    "23": "Drumstick ----------Benefits:The fresh leaves of the drumstick tree are used in anaemia as they are rich in iron which may help improve haemoglobin levels. Drumstick leaves due to a high nutritional content may help in malnutrition. Drumstick leaves may help manage asthma by relaxing respiratory muscles and improving breathing.----------location:(https://www.bigbasket.com/pd/30006607/fresho-drumstick-leaves-250-g/)",
    "24": "Ekka -----------Benefits:It will interest you to know that aak leaves are rich in antioxidants and have anti-inflammatory properties. Dr. Pramod Tripathi said, “These are used in the treatment of ailments like rheumatoid arthritis, bronchial asthma and nervous disorders.----------location:(https://www.greendna.in/products/aak-leaves)",
    "25": "Eucalyptus ----------Benefits:Eucalyptus tea contains cineol, a substance that helps to treat respiratory infections like colds, flu and sinusitis. It can also help to relieve congestion in the airways, and can therefore be used to improve breathing, unobstruct airways and open up a stuffy nose.---------location:(https://www.greendna.in/products/organic-fresh-eucalyptus-leaves)",
    "26": "Ganigale -------Benefits:Despite the danger, oleander seeds and leaves are used to make medicine. Oleander is used for heart conditions, asthma, epilepsy, cancer, painful menstrual periods, leprosy, malaria, ringworm, indigestion, and venereal disease; and to cause abortions.-------------location:(https://www.bigbasket.com/pd/40232540/fresho-aralioleander-flower-used-to-decorate-for-festivals-puja-100-g/)",
    "27": "Ganike -----------Benefits:Ganike or Kakke soppu in Kannada, Manathakkali keerai in Tamil. The nightshade plant is believed to have medicinal benefits. It is commonly consumed for issues like stomach and mouth ulcers, as well as constipation. --------------location:(https://www.greendna.in/products/organic-kashi-soppu)",
    "28": "Gasagase -------benefits:Poppy seeds are often said to offer various other benefits, including promoting digestion, boosting skin and hair health, and treating headaches, coughs, and asthma. Although direct studies are lacking, some research links individual poppy seed nutrients or compounds to some of these effects. May aid digestion. ----------location:(https://simplesoul.in/product/khus-khus/)",
    "29": "Ginger -----------benefits:It has been widely used for arthritis, cramps, sprains, sore throats, rheumatism, muscular aches, pains, vomiting, constipation, indigestion, hypertension, dementia, fever and infectious diseases. Ginger leaves have also been used for food-flavouring and Asian Traditional Medicine especially in China.----------location:(https://www.etsy.com/in-en/market/ginger_leaf)",
    "30": "Globe Amarnath ---------benefits:Globe Amaranth has relaxing qualities and may also help with headaches, digestive issues, diabetes, and high blood pressure. This herbal tea infusion is not intended to cure, treat, or prevent any disease, though certain compounds found in it may support or benefit your health. ---------------location:(https://nurserylive.com/products/gomphrena-plant-1)",
    "31": "Guava -----------benefits:The guava leaves are rich in vitamins, minerals, and antioxidants. They contain essential nutrients like Vitamin C, A, and potassium, offering a wide range of health benefits. They can help with digestion, control blood sugar levels, boost your immune system, improve your skin, and even promote hair growth.-----------location:(https://www.greendna.in/products/organic-guava-leaves)",
    "32": "Henna -------------benefit:Henna contains substances that might help fight certain infections. There is also some information that henna might decrease the growth of tumors, prevent or reduce spasms, decrease inflammation, and relieve pain.----------------location:(https://www.greendna.in/products/organic-mehandi-leaves)",
    "33": "Hibiscus ------------benefits:Hibiscus is high in antioxidants and offers many potential benefits. In particular, it may help promote weight loss, reduce the growth of bacteria and cancer cells, and support the health of the heart and liver.------------location:(https://www.kediaorganic.com/products/hibiscus-leaves)",
    "34": "Honge --------------benefits:Rheumatism, gonorrhea, skin diseases, genitalia, fever, piles, scabies, anthelmintic, diarrhea, dyspepsia, flatulence, glycosuria, antiseptic, blood purifier, and wound treatment.-----------location:(https://www.plantsguru.com/pongamia-pinnata-karanj)",
    "35": "Insulin ------------benefits:The diabetes patients have to chew down the Insulin plants leaves for a month. That is the patient has to take two leaves per day in the morning and evening for one week. Care should be taken that the leaves must be chewed well before swallowing.--------------location:(https://dir.indiamart.com/impcat/insulin-plant.html)",
    "36": "Jackfruit ------------benefits:Jackfruit leaves and roots contain chemicals that might help control blood sugar increases after eating. Its fruit is a source of vitamin A, fiber, and protein. People use jackfruit for diabetes, wound healing, and many other conditions, but there is no good scientific evidence to support these uses.-------------location:(https://gachwala.in/products/fresh-jackfruit-leaves-artocarpus-heterophyllus-jackfruit-tree-leaves-50-fresh-leaves/)",
    "37": "Jasmine ----------------- benefits:Jasmine has been used for liver disease (hepatitis), pain due to liver scarring (cirrhosis), and abdominal pain due to severe diarrhea (dysentery). It is also used to prevent stroke, to cause relaxation (as a sedative), to heighten sexual desire (as an aphrodisiac), and in cancer treatment.---------location:(https://teacultureoftheworld.com/products/jasmine-leaf)",
    "38": "Kambajala -----------Benefits:It is well-known for treating respiratory issues, rheumatoid arthritis, scabies, insect bites, and it also aids in the healing of wounds. Bronchitis, amniocentesis, mouth ulcers, asthma, pneumonia, and epilepsy are all treated with a decoction produced from whole herbs.-------location:(https://myonlinevipani.com/shop/vayana-leaf-pack-of-20/)",
    "39": "Kasambruga ------------benefits:Consuming Kasmard juice after meals help in managing cough. Kasmard helps in wound healing as it accelerates the process of wound contraction and closure due to its antioxidant properties. It also has antimicrobial properties that help in preventing skin infections.-------------location:(https://ayurvedacart.in/kasmard-2426)",
    "40": "Kohlrabi -----------benefits:A. Kohlrabi leaves are entirely edible and a good source of fibre. However, most of the nutrition is in the bulb. Leaves can be eaten as a part of salad and have antioxidants in them, which can help with free radicals and can be helpful in skin problems, heart diseases, and a healthy gut.-------------location:(https://www.allthatgrows.in/products/kohlrabi-purple-baby-leaf-seeds)",
    "41": "Lantana -------------benefit:Studies conducted in India have found that Lantana leaves can display antimicrobial, fungicidal and insecticidal properties. L. camara has also been used in traditional herbal medicines for treating a variety of ailments, including cancer, skin itches, leprosy, chicken pox, measles, asthma and ulcers.------------location:(https://www.greendecor.in/plant/buy-Lantana-plants-online-in-delhi/)",
    "42": "Lemon --------------benefits:Lemon's glycosides and flavonoids reinforce capillaries and improve circulation. Lemon leaves, rich in limonene and terpene compounds with calming and antispasmodic properties, are also recommended against palpitations, insomnia, headaches and asthma.-----------location:(https://www.frugivore.in/product-details/fresh-lemon-leaves)",
    "43": "Lemongrass -----------benefits:Lemongrass is a rich source of flavonoids and phenolic compounds, which contain antioxidants. It's also an effective antibacterial and antifungal agent that contains anti-inflammatory and antioxidant properties. Lemongrass contains quercetin, a flavonoid known for having antioxidant and anti-inflammatory benefits.-----------location:(https://teatrunk.in/products/lemongrass-leaves)",
    "44": "Malabar_Nut ----------benefits:Malabar nut is a plant. People use the leaf to make medicine. Malabar nut is used to loosen chest congestion, open the breathing tubes (bronchi), and treat spasms. It is used for upper airway infections, common colds, cough, asthma, and tuberculosis.--------location:(https://gachwala.in/products/gachwala-vasaka-justicia-adhatoda-live-plant-malabar-nut-vasa-adhatoda-medicinal-herb-medicinal-plant-live-with-pot/)",
    "45": "Malabar_Spinach ---------benefits:Malabar spinach is an excellent source of iron besides calcium, Vitamin A, magnesium, and protein. It also has ample amounts of phosphorus and potassium besides B-complex vitamins such as folate, Vitamin B6, and riboflavin. Its fresh leaves have amazing antioxidants such as lutein, and zeaxanthin.------------location:(https://freshji.in/product/organic-vegetables/malabar-spinach/)",
    "46": "Mango -----------benefits:Mango leaves have antioxidant properties that can combat signs of skin aging, increase collagen production, and promote wound healing. Mangiferin, a compound present in mango leaves, may also help treat psoriasis (a skin condition that causes itchy, dry patches).----------location:(https://getflowersdaily.com/shop/mango-leaves/)",
    "47": "Marigold -----------Benefits:According to Ayurvedic and Unani medicine, the flowers and leaves of marigold have anti-inflammatory, antipyretic, antimicrobial, and antiepileptic effects [11]. Marigolds are generally administered in tinctures, ointments, and infusions to treat wounds for inflammation of the skin and mucous membranes.-----------location:(https://www.urvann.com/collection/marigold-collection)",
    "48": "Mint ---------------benefits:Mint is a popular herb that may possess potential health benefits. This may include helping with digestive health, reducing allergic symptoms, and soothing common cold symptoms. Mint or mentha belongs to the Lamiaceae family, which contains around plant species, including peppermint and spearmint.--------------location:(https://www.bigbasket.com/pd/10000137/fresho-mint-leaves-cleaned-without-roots-100-g/)",
    "49": "Neem -------------benefits:Neem preparations are reportedly efficacious against a variety of skin diseases, septic sores, and infected burns. The leaves, applied in the form of poultices or decoctions, are also recommended for boils, ulcers, and eczema. The oil is used for skin diseases such as scrofula, indolent ulcers, and ringworm.---------------location:(https://www.pureroot.in/p/neem-leaves)",
    "50": "Nelavembu ----------benefit:Nilavembu helps to manage blood sugar levels and is useful for people suffering from diabetes. It also helps fight cancer and detoxifies the liver. Its rich source of antimicrobial and antiviral properties help manage all kinds of fever including dengue, typhoid, influenza, malaria and chikungunya.--------------location:(https://www.indiamart.com/proddetail/nilavembu-leaves-16010995948.html)",
    "51": "Nerale -------------benefits:Leaves of jamun collected as agro by-produce during the cultivation of jamun is traditionally used as ayurvedic medicine to treat diabetes, gall bladder stones and other ailments.----------------location:(https://srisatymev.com/srisatymev-shop-indianjadibooti-jadistore/jamun-leaves-blackberry/)",
    "52": "Nooni ----------benefits:The leaves can be boiled and consumed like tea, to treat fever. Chewing Noni leaves can relieve sore throat. Blood clots can be prevented by applying noni leaf extracts. The leaves can be powered and used to treat burns, boils, and wounds as well.----------location:(https://www.greendna.in/products/organic-noni-leaves)",
    "53": "Onion -------------benefits:What are the spring onion benefits? Spring onion might be good for health as it might potentially have antioxidant, anti-platelet activity, anti-thrombotic, anti-diabetic, anti-inflammatory, anti-asthmatic, anti-cancer, and anti-microbial properties.----------location:(https://www.bigbasket.com/pd/20000981/fresho-spring-onion-with-roots-100-g/)",
    "54": "Padri -------------benefits:Health Benefits: Curry leaves are rich in antioxidants, vitamins (such as A, B, C, and E), and minerals. They are believed to have various health benefits, including aiding digestion, promoting hair health, reducing cholesterol, controlling diabetes, and having anti-inflammatory properties.-----------location:(http://www.floraofbangladesh.com/2019/11/parul-or-fragrant-padri-tree.html)",
    "55": "Palak(Spinach) ----------Benefits:Spinach is rich in iron, vitamin C and E, potassium, and magnesium. As part of a nutritious diet, it can help support immune function, aid the digestive system, may even have anticancer properties. However, certain individuals may need to eat this vegetable in moderation.------------location:(https://fastandfresh.in/products/spinach)",
    "56": "Papaya ----------------benefits:Papaya leaf juice can be beneficial for people with a weak immune system. You can have it on a daily basis to give a boost to your immunity. 3. If you are on a high protein, papaya leaf juice can help in breaking down protein into amino acid and peptides.---------location:(https://www.greendna.in/products/papaya-leaves-organic)",
    "57": "Parijatha --------benefits: For swelling and pain: Boil leaves in water to make decoction and drink. * For arthritis: Take leaves, bark, flower (of Parijaat), about 5 gm and make a decoction with 200 gm of water. Decoction is said to be formed when water reduces to ¼ of initial quantity.------------location:(https://www.indiamart.com/proddetail/parijat-leaves-harsingar-nyctanthes-arbortristis-16899017948.html)",
    "58": "Pea ----------------benefits:Pea shoots are extremely rich in vitamin C, supplying about 44% of an adult's DA. Vitamin C is key in maintaining bones and teeth, proper immune system functioning, absorption of iron, wound repair, and many other key bodily functions. Pea shoots contain the same amount of vitamin C as blueberries.------------------location:(https://thenortheastshop.in/product/8823684/Green-pea-leaf)",
    "59": "Pepper ---------------benefits:Mountain pepper leaf is rich in antioxidants which help protect cells against the damaging effects of free radicals and may prevent or delay cancer, diabetes and Alzheimer's, as well as autoimmune and cardiovascular diseases.---------------location:(https://www.indiamart.com/proddetail/black-pepper-leaves-15604837073.html)",
    "60": "Pomoegranate ----------benefits:Regarding its medicinal use, the P. granatum leaves show antioxidant, anti-inflammatory, antimetabolic, anticancer, and antimicrobial activity. This potential is normally related to the presence of secondary metabolites, mainly phenolic compounds, tannins and their monomers (ellagic acid and gallic acid).------------location:(https://www.indiamart.com/proddetail/dried-pomegranate-leaves-22027015991.html)",
    "61": "Pumpkin -------benefits:Pumpkin leaves are also rich in essential minerals, including potassium, which is required for muscle contractions, fluid balance, and chemical signaling between neurons,It also helps ensure the kidneys, digestive system, and heart are functioning properly.--------------location:(https://www.greendna.in/products/organic-pumpkin-leaves)",
    "62": "Raddish -----------Benefits:Radish leaves might be good for gut health and reducing obesity, according to one study. The leaves also have more fiber than the roots and fiber is good for preventing constipation. A 2008 study with rats found that fresh radish juice may help to stop stomach ulcers from forming.----------location:(https://www.greendna.in/products/radish-leaf)",
    "63": "Rose ---------------benefits:Various parts of rose such as fruits, flowers, leaves, and bark can be used in various product development, including cosmetics, food, pharmaceuticals, and engineering. The medical benefits of roses include the treatment of inflammation, diabetes, dysmenorrhea, depression, stress, seizures, and aging.--------------location:(https://www.indiamart.com/proddetail/dry-rose-leaf-21497918933.html)",
    "64": "Sampige ----------------benefits:Leaves act as anti-inflammatory agents, thus effective in treating swellings. The juice of the leaves along with honey is an antidote for colic pain in infants. The decoction of the leaves is effective for treating arthritis, angina and pharyngitis.--------------location:(https://nurserylive.com/products/michelia-champa-son-champa-orange-plant)",
    "65": "Sapota -------------benefits:Chikoo (Sapota) is rich in dietary fibre, vitamins (such as vitamin C and vitamin A) and minerals (including potassium and calcium). These nutrients contribute to various health benefits, such as supporting digestion, boosting the immune system, promoting bone health and providing a quick energy boost.----------location:(https://www.setgreen.com/product-details/sapota-plant)",
    "66": "Seethaashoka -------------Benefits:Ashoka tree is useful to manage female disorders like dysmenorrhea and menorrhagia due to its Vata balancing property. It also helps to control bleeding in piles due to its Sita (cold) property. Ashoka powder is also an effective remedy for managing worm infestation due to its Krimighna (anti-worm) property.--------------location:(https://paudhshala.com/plants-nursery-in-india/saracca-asoa-sorrowless-tree-plant.html)",
    "67": "Seethapala ---------------benefits:The topical application of crushed leaves is used in the management of ulcers and wounds. Leaf decoction is also taken in case of dysentery[12]. Custard apple leaves reduce inflammation and help in quick healing when applied on the affected area. This is because of its Ropan (healing) and Sita (cool) properties.----------------------location:(https://www.kediaorganic.com/products/custard-apple-leaves)",
    "68": "Spinach1 ---------------benefits:Spinach is rich in iron, vitamin C and E, potassium, and magnesium. As part of a nutritious diet, it can help support immune function, aid the digestive system, may even have anticancer properties.--------------location:(https://farmfreshbangalore.com/products/palak-1-bunch)",
    "69": "Tamarind -----------------benefits:Tamarind has played an important role in traditional medicine. In beverage form, it was commonly used to treat diarrhea, constipation, fever, and malaria. The bark and leaves were also used to promote wound healing.------------location:(https://www.greendna.in/products/tender-tamrind-leaves)",
    "70": "Taro -------------Benefits:The health benefits of taro or arbi leaves are genuinely remarkable. From being a rich source of essential nutrients like iron, vitamin C, and folate to offering potential advantages for skin health, reproductive health, and cardiovascular well-being, taro leaves are a valuable addition to a balanced diet.---------------location:(https://www.bigbasket.com/pd/30001956/fresho-colocasia-leaf-1-kg/)",
    "71": "Tecoma --------------benefits:Almost all parts (leaves, root, flower, seed, fruit, bark) of the plant is reported for its medicinal use. Tecoma stans is a herbal medicine used for treatment of diabetes, digestive problems, control of yeast infections, as powerful diuretic, vermifuge and tonic.-----------------location:(https://www.santhionlineplants.com/product/tecoma-orange-plant-capensis/)",
    "72": "Thumbe ----------benefits:Thumbai leaves are called Thumbai ilai. It used to cure many diseases. The folk use of this herb is for treating scorpion stings, snake bites, coughs, fever, etc. The whole plant has fever-reducing and insecticidal properties.--------------location:(https://www.herbalplantslive.com/product/buy-thumbai-siru-thumbai-leucas-aspera-plant-online-india-at-best-price/)",
    "73": "Tomato -------------Benefits:Tomato leaves are good for your health. They help fight diseases such as diabetes, cancer, and heart disease. Mint sauce. In this article, you will learn about the benefits, and how to prepare sauces and plant sprays.------------location:(https://www.santhionlineplants.com/product/tomato-plant-thakkali/)",
    "74": "Tulsi --------benefits:These studies reveal that tulsi has a unique combination of actions that include: Antimicrobial (including antibacterial, antiviral, antifungal, antiprotozoal, antimalarial, anthelmintic), mosquito repellent, anti-diarrheal, anti-oxidant, anti-cataract, anti-inflammatory, chemopreventive, radioprotective,-------------location:(https://www.bigbasket.com/pd/30006466/fresho-tulsi-leaves-100-g/)",
    "75": "Turmeric -----------Benefits:However, several studies have reported that turmeric leaves possess pharmacological properties, including antioxidant, anti-inflammatory, antitumor, and antibacterial effects, arising from its radical scavenging activity.-------------------location:(https://healthybuddha.in/turmeric-leaf-fresh-natural-healthybuddha)",
    "76": "ashoka ------------benefits:According to Ayurveda, Ashoka is useful in controlling internal bleeding, especially in the case of piles due to its Kasaya (astringent) property. It is also beneficial in relieving pain and healing wounds faster due to its Ropan (healing) property.--------------location:(https://dir.indiamart.com/impcat/ashoka-tree.html)",
    "77": "camphor --------------benefits:It is effective on itching and irritation, acne, soothing burn injuries, eczema, nail fungus, cracked heels and provides relief from pain. It is commonly used in various skin care products due to its beneficial attributes.--------------location:(https://www.indiamart.com/proddetail/seekanapalli-organics-camphor-leaves-1000-gram-22641499391.html)",
    "78": "kamakasturi ------------Benefits:Kama Kasturi seeds, also known as basil seeds, sabja seeds, faluda seeds, and tukmaria seeds, are an underappreciated ingredient in our kitchens. They resemble sesame seeds in appearance. The form we usually eat comes from the sweet basil plant or Ocimum Basilicum and is used for seasoning.------------------location:(https://www.indiamart.com/proddetail/sabja-seeds-basil-seeds-for-weight-loss-organic-tulsi-beej-kamakasturi-tumkaria-sbja-for-falooda-24868499397.html)",
    "79": "kepala ----------------Benefits:The carbazole alkaloids present in curry leaves are believed to possess anti-obesity properties. Beyond weight loss, curry leaves have been linked to improved digestion, reduced risk of heart disease, and lowered cholesterol levels,” said Hansaji Yogendra, directo.---------------location:(https://www.amazon.com/Kepala-Djenggot-Green-Tea-Loose/dp/B07PY7PMG7)"
}